--- rexxcps.rexx.orig	1993-06-25 12:14:43 UTC
+++ rexxcps.rexx
@@ -1,4 +1,4 @@
-/* ReXX */
+/*usr/bin/true;exec rexx -x "$0" "$@";exit# ReXX */
   /* Take a measure of REXX clauses-per-second (CPS)                 */
   /* Mike Cowlishaw (mfc@ibm.com).  Multi-platform.                  */
   /* 1.0 17 Jan 89 Original version                                  */
