--- rexxcps.rexx	Fri Jun 25 05:14:43 1993
+++ rexxcps.rexx.new	Fri Sep  7 15:10:03 2001
@@ -1,4 +1,4 @@
-/* ReXX */
+/*usr/bin/true;exec rexx -x "$0" "$@";exit# ReXX */
   /* Take a measure of REXX clauses-per-second (CPS)                 */
   /* Mike Cowlishaw (mfc@ibm.com).  Multi-platform.                  */
   /* 1.0 17 Jan 89 Original version                                  */
