Repository: freebsd/freebsd-ports
Catalog: converters/recode/files/*.po
Languages: ru

source: UCS2 Mne Description
ru: UCS2 Mne Описание

source: No error
ru: Ошибки нет

source: Non canonical input
ru: Неканонический ввод

source: Ambiguous output
ru: Неоднозначный вывод

source: Untranslatable input
ru: Нетранслируемый ввод

source: Invalid input
ru: Неверный ввод

source: System detected problem
ru: Системно обнаруженная ошибка

source: Misuse of recoding library
ru: Неправильное использование библиотеки перекодировки

source: Internal recoding bug
ru: Внутренняя ошибка перекодировки

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
ru: Это свободная программа; вы можете распространять и/или изменять ее при соблюдении условий Универсальной Общественной Лицензии GNU, опубликованной Фондом Свободного Программного Обеспечения, версии 2 или любой более поздней (по вашему усмотрению). Эта программа распространяется в надежде, что она будет полезной, но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ; даже без подразумеваемых гарантий КОММЕРЧЕСКОЙ ЦЕННОСТИ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. Для получения более подробной информации, смотрите Универсальную Общественную Лицензию GNU. Вы должны были получить копию Универсальной Общественной Лицензии GNU вместе с этой программой, если нет, напишите Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: Try `%s %s' for more information.
ru: Попробуйте `%s %s' для более подробной информации.

source: Free `recode' converts files between various character sets and surfaces.
ru: Free `recode' преобразует файлы между различными наборами символов и представлениями.

source: Usage: %s [OPTION]... [ [CHARSET] | REQUEST [FILE]... ]
ru: Использование: %s [КЛЮЧ]... [ [НАБОР-СИМВОЛОВ] | ЗАПРОС [ФАЙЛ]... ]

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
ru: Если длинный вариант ключа требует наличия аргумента, то этот аргумент обязателен также для соответствующего короткого ключа. Аналогично для необязательных ключей.

source: Listings: -l, --list[=FORMAT] list one or all known charsets -k, --known=PAIRS restrict charsets according to known PAIRS list -h, --header[=[LN/]NAME] write table NAME on stdout using LN, then exit -F, --freeze-tables write out a C module holding all tables -T, --find-subsets report all charsets being subset of others -C, --copyright display Copyright and copying conditions --help display this help and exit --version output version information and exit
ru: Вывод: -l, --list[=ФОРМАТ] вывести один или все известные наборы символов -k, --known=ПАРЫ ограничить наборы символов в соответствии с известными ПАРАМИ -h, --header[=[ЯЗЫК/]ИМЯ] записать таблицу ИМЯ в стандартный вывод, используя ЯЗЫК, затем выйти -F, --freeze-tables записать модуль на Си, содержащий все таблицы -T, --find-subsets вывести все наборы символов, являющиеся подмножествами остальных -C, --copyright вывести информацию об авторских правах и условиях распространения --help вывести эту справку и выйти --version вывести информацию о версии и выйти

source: Operation modes: -v, --verbose explain sequence of steps and report progress -q, --quiet, --silent inhibit messages about irreversible recodings -f, --force force recodings even when not reversible -t, --touch touch the recoded files after replacement -i, --sequence=files use intermediate files for sequencing passes --sequence=memory use memory buffers for sequencing passes
ru: Режимы работы: -v, --verbose объяснить последовательность шагов и выдавать отчет о степени завершения -q, --quiet, --silent не выводить сообщения о необратимых перекодировках -f, --force продолжать перекодировку несмотря на необратимость -t, --touch обновить время создания файла после замещения -i, --sequence=files использовать временные файлы для последовательных проходов --sequence=memory использовать оперативную память для последовательных проходов

source: -p, --sequence=pipe use pipe machinery for sequencing passes
ru: -p, --sequence=pipe использовать механизм каналов для последовательных проходов

source: -p, --sequence=pipe same as -i (on this system)
ru: -p, --sequence=pipe то же, что -i (на этой системе)

source: Fine tuning: -s, --strict use strict mappings, even loose characters -d, --diacritics convert only diacritics or alike for HTML/LaTeX -S, --source[=LN] limit recoding to strings and comments as for LN -c, --colons use colons instead of double quotes for diaeresis -g, --graphics approximate IBMPC rulers by ASCII graphics -x, --ignore=CHARSET ignore CHARSET while choosing a recoding path
ru: Тонкая настройка: -s, --strict использовать точные отображения, даже ценой потери символов -d, --diacritics переводить только диакритические знаки для HTML/LaTeX -S, --source[=ЯЗЫК] ограничить перекодировку для ЯЗЫКА строками и коментариями -c, --colons использовать двоеточия вместо двойных кавычек при обозначении тремы -g, --graphics заменять линии IBMPC псевдографикой ASCII -x, --ignore=НАБ-СИМВ игнорировать НАБ-СИМВ при выборе способа перекодировки

source: Option -l with no FORMAT nor CHARSET list available charsets and surfaces. FORMAT is `decimal', `octal', `hexadecimal' or `full' (or one of `dohf').
ru: Ключ -l без ФОРМАТа и НАБОРА-СИМВОЛОВ выводит список возможных наборов и представлений. ФОРМАТ может быть `decimal', `octal', `hexadecimal' или `full' (или одно из `dohf').

source: Unless DEFAULT_CHARSET is set in environment, CHARSET defaults to `%s'.
ru: Если в среде отсутствует переменная DEFAULT_CHARSET, НАБОР-СИМВОЛОВ устанавливается в `%s'.

source: CHARSET has no default, define DEFAULT_CHARSET in the environment.
ru: НАБОР-СИМВОЛОВ не имеет значения по умолчанию, определите DEFAULT_CHARSET в среде.

source: With -k, possible before charsets are listed for the given after CHARSET, both being tabular charsets, with PAIRS of the form `BEF1:AFT1,BEF2:AFT2,...' and BEFs and AFTs being codes are given as decimal numbers.
ru: С ключем -k выводятся возможные варианты исходного НАБОРА-СИМВОЛОВ для заданного конечного, если оба они являются табличными. ПАРЫ должны иметь форму `ДО1:ПОСЛЕ1,ДО2:ПОСЛЕ2,...' причем ДОn и ПОСЛЕn являются кодами, заданными в виде десятичных чисел.

source: LN is some language, it may be `c', `perl' or `po'; `c' is the default.
ru: ЯЗЫК представляет язык программирования; это может быть `c', `perl' или `po'. По умолчанию используется `c'.

source: REQUEST is SUBREQUEST[,SUBREQUEST]...; SUBREQUEST is ENCODING[..ENCODING]... ENCODING is [CHARSET][/[SURFACE]]...; REQUEST often looks like BEFORE..AFTER, with BEFORE and AFTER being charsets. An omitted CHARSET implies the usual charset; an omitted [/SURFACE]... means the implied surfaces for CHARSET; a / with an empty surface name means no surfaces at all. See the manual.
ru: ЗАПРОС состоит из ПОДЗАПРОС[,ПОДЗАПРОС]... ПОДЗАПРОС состоит из КОДИРОВКА[..КОДИРОВКА]... КОДИРОВКА есть [НАБОР-СИМВОЛОВ][/[ПРЕДСТАВЛЕНИЕ]]... ЗАПРОС часто выглядит как ДО..ПОСЛЕ, где ДО и ПОСЛЕ суть наборы символов. Если НАБОР-СИМВОЛОВ опущен, используется набор по умолчанию; если опускается [/ПРЕДСТАВЛЕНИЕ]..., используется подразумеваемое представление для данного НАБОРА-СИМВОЛОВ; / без имени представления означает его отсутствие. Смотрите руководство.

source: If none of -i and -p are given, presume -p if no FILE, else -i. Each FILE is recoded over itself, destroying the original. If no FILE is specified, then act as a filter and recode stdin to stdout.
ru: Если не задано ни -i, ни -p, подразумевается -p, если нет ФАЙЛа, иначе -i. Каждый ФАЙЛ перекодируется в файл с тем же именем, уничтожая исходный. Если ФАЙЛ не задан, то программа работает как фильтр, перекодируя стандартный вход на стандартный выход.

source: Report bugs to <recode-bugs@iro.umontreal.ca>.
ru: О замеченных ошибках сообщайте по адресу <recode-bugs@iro.umontreal.ca>.

source: Ambiguous sequence `%s'
ru: Неоднозначная последовательность `%s'

source: Unknown sequence `%s'
ru: Неизвестная последовательность `%s'

source: Ambiguous language `%s'
ru: Неоднозначный язык `%s'

source: Unknown language `%s'
ru: Неизвестный язык `%s'

source: Ambiguous format `%s'
ru: Неоднозначный формат `%s'

source: Unknown format `%s'
ru: Неизвестный формат `%s'

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ru: Это свободное программное обеспечение; условия распространения находятся в исходном тексте. Не предоставляется НИКАКИХ гарантий, даже гарантии ПОЛЕЗНОСТИ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ.

source: Written by Franc,ois Pinard <pinard@iro.umontreal.ca>.
ru: Программа написана Франсуа Пинардом <pinard@iro.umontreal.ca>.

source: Deprecated syntax, please prefer `%s'
ru: Нерекомендованный синтаксис, используйте, пожалуйста, `%s'

source: Erroneous request `%s'
ru: Ошибочный запрос `%s'

source: Recoding %s...
ru: Перекодировка %s...

source: done
ru: готово

source: failed: %s in %s..%s
ru: ошибка: %s в %s..%s

source: %s failed: %s in %s..%s
ru: %s закончилось неудачей: %s в %s..%s

source: %s in %s..%s
ru: %s в %s..%s

source: Charset %s already exists and is not %s
ru: Набор символов %s уже существует и не является %s

source: Cannot list `%s', no names available for this charset
ru: Невозможно вывести `%s', для этой набора символов нет доступных имен

source: Sorry, no names available for `%s'
ru: Извините, для `%s' нет доступного имени

source: Resurfacer set more than once for `%s'
ru: Изменение представления для `%s' установлено более одного раза

source: Virtual memory exhausted
ru: Виртуальная память исчерпана

source: Codes %3d and %3d both recode to %3d
ru: Коды %3d и %3d оба переходят в %3d

source: No character recodes to %3d
ru: Нет символа, переводящегося в %3d

source: Cannot invert given one-to-one table
ru: Невозможно обратить данную взаимнооднозначную таблицу

source: Following diagnostics for `%s' to `%s'
ru: Далее следует диагностика для `%s' в `%s'

source: Pair no. %d: <%3d, %3d> conflicts with <%3d, %3d>
ru: Пара номер %d: <%3d, %3d> конфликтует с <%3d, %3d>

source: Cannot complete table from set of known pairs
ru: Не удается закончить таблицу из набора известных пар

source: Identity recoding, not worth a table
ru: Тождественная перекодировка, нет необходимости в таблице

source: Recoding is too complex for a mere table
ru: Перекодировка слишком сложна для простой таблицы

source: %sConversion table generated mechanically by Free `%s' %s
ru: %sТаблица перекодировки создана автоматически с помощью Free `%s' %s

source: %sfor sequence %s.%s
ru: %sдля последовательности %s.%s

source: No table to print
ru: Нет таблицы для печати

source: reversible
ru: обратимый

source: %s to %s
ru: %s в %s

source: byte
ru: байт

source: variable
ru: переменная

source: *Unachievable*
ru: *Недоступный*

source: *mere copy*
ru: *просто копия*

source: Virtual memory exhausted!
ru: Виртуальная память исчерпана!

source: Step initialisation failed
ru: Ошибка шага инициализации

source: Step initialisation failed (unprocessed options)
ru: Ошибка шага инициализации (необработанный ключ)

source: Request: %s
ru: Запрос: %s

source: Shrunk to: %s
ru: Сжать до: %s

source: Unrecognised surface name `%s'
ru: Нераспознанное имя представления `%s'

source: No way to recode from `%s' to `%s'
ru: Нет возможности перекодировать из `%s' в `%s'

source: Expecting `..' in request
ru: В запросе ожидается `..'

source: Child process wait status is 0x%0.2x
ru: Статус ожидания дочернего процесса равен 0x%0.2x
