--- src/trans/slowo3.cpp.orig	Sat Jul 31 23:59:35 2004
+++ src/trans/slowo3.cpp	Sun Jan  2 19:38:38 2005
@@ -7,7 +7,6 @@
 /***************************************************************************/
 
 # include <stdio.h>
-# include <malloc.h>
 # include <string.h>
 # include <stdlib.h>
 
@@ -1516,13 +1515,6 @@
 t_sTree * t_Slowo3 :: tree( long i_tree )
 {
    return &Tree[i_tree] ;
-}
-/***************************************************************************/
-//
-/***************************************************************************/
-t_sStruct * t_Slowo3 :: sstruct( long i_struct )
-{
-   return &Struct[i_struct] ;
 }
 /***************************************************************************/
 //              дать переводимую структуру
