--- ./gourmet/defaults/defaults_ru.py.orig	2013-03-02 03:01:49.000000000 +0400
+++ ./gourmet/defaults/defaults_ru.py	2013-03-23 17:02:12.000000000 +0400
@@ -661,15 +661,15 @@
          ["кг", ["килограмм","кг", "кг", "килограмм"]],
          # These names aren't really convertible, but we want them to
          # be recognized as units...
-         ['мало'],         
-         ['средне'],
-         ['много'],
-         ['луковица',['луковиц']],
-         ['целый',['целый','целое','целая']],
-         ['упаковка',['пакет']],
-         ['ящик'],
-         ['банка'],
-         ['ломтей',['ломоть','ломти']],
+         ['мало', ['мало']],
+         ['средне', ['средне']],
+         ['много', ['много']],
+         ['луковица', ['луковица','луковиц']],
+         ['целый', ['целый','целое','целая']],
+         ['упаковка',['упаковка','пакет']],
+         ['ящик', ['ящик']],
+         ['банка', ['банка']],
+         ['ломтей', ['ломтей','ломоть','ломти']],
          ]
 
 METRIC_RANGE = (1,999)
